src/cf/InformationRegisters/ПравилаРегистрацииКафка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПравилаРегистрацииКафка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыКафка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/лимсПравилаРегистрацииКафка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>лимсПравилаРегистрацииКафка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лимсМаршрутыКафка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/УправлениеОбменомПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция МаршрутыДляОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, СсылкаНаОбъект) Экспорт
	
	МаршрутыДляОбъектаМетаданных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПравил.Маршрут КАК Маршрут,
	|	ТаблицаПравил.Режим КАК Режим,
	|	ТаблицаПравил.Запрос КАК Запрос
	|ИЗ
	|	РегистрСведений.ПравилаРегистрацииКафка КАК ТаблицаПравил
	|ГДЕ
	|	ТаблицаПравил.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Режим = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда Тогда
				МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = Выборка.Запрос;
				Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МаршрутыДляОбъектаМетаданных;
	
КонецФункции

Функция лимсМаршрутыДляОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, СсылкаНаОбъект) Экспорт
	
	МаршрутыДляОбъектаМетаданных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмяОбъектаМетаданных", ПолноеИмяОбъектаМетаданных);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПравил.Маршрут КАК Маршрут,
	|	ТаблицаПравил.Режим КАК Режим,
	|	ТаблицаПравил.Запрос КАК Запрос
	|ИЗ
	|	РегистрСведений.лимсПравилаРегистрацииКафка КАК ТаблицаПравил
	|ГДЕ
	|	ТаблицаПравил.ПолноеИмяОбъектаМетаданных = &ПолноеИмяОбъектаМетаданных";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Режим = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда Тогда
				МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = Выборка.Запрос;
				Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					МаршрутыДляОбъектаМетаданных.Добавить(Выборка.Маршрут);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МаршрутыДляОбъектаМетаданных;
	
КонецФункции

#КонецОбласти
